{
    "password, passwords, passcodes, passphrases": {
        "responses": [
            "Use a mix of letters, numbers, and symbols for strong passwords.",
            "Change your passwords regularly to enhance security.",
            "Avoid using easily guessable passwords like '123456' or 'password'."
        ],
        "followUps": [
            "Would you like tips on how to create a strong password?",
            "Do you want to know about password managers?",
            "Are you interested in learning about two-factor authentication?"
        ]
    },
    "phishing, scam emails": {
        "responses": [
            "Be cautious of emails asking for personal information.",
            "Check the sender's email address for authenticity.",
            "Do not click on links in suspicious emails."
        ],
        "followUps": [
            "Would you like to know how to identify phishing emails?",
            "Do you want to learn about reporting phishing attempts?",
            "Are you interested in tips for safe browsing?"
        ]
    },
    "malware, viruses": {
        "responses": [
            "Keep your antivirus software updated to protect against malware.",
            "Avoid downloading software from untrusted sources.",
            "Regularly scan your system for malware."
        ],
        "followUps": [
            "Do you want to know how to remove malware from your system?",
            "Would you like tips on safe downloading practices?",
            "Are you interested in learning about different types of malware?"
        ]
    },
    "two-factor authentication, 2FA, MFA": {
        "responses": [
            "Two-factor authentication adds an extra layer of security to your accounts.",
            "Using 2FA helps prevent unauthorized access even if your password is compromised.",
            "Enable MFA to protect sensitive information with an additional verification step."
        ],
        "followUps": [
            "Would you like to learn how to set up 2FA on your accounts?",
            "Do you want to know which apps support multi-factor authentication?",
            "Are you interested in understanding the benefits of using 2FA?"
        ]
    },
    "public Wi-Fi, unsecured networks": {
        "responses": [
            "Avoid accessing sensitive information over public Wi-Fi networks.",
            "Unsecured networks can expose your data to potential attackers.",
            "Use a VPN when connecting to public Wi-Fi to encrypt your internet traffic."
        ],
        "followUps": [
            "Would you like tips on staying safe while using public Wi-Fi?",
            "Do you want to learn how VPNs can protect your online activities?",
            "Are you interested in best practices for using public networks securely?"
        ]
    },
    "software updates, patches": {
        "responses": [
            "Regularly updating your software helps protect against known vulnerabilities.",
            "Install patches promptly to ensure your systems are secure.",
            "Outdated software can be a gateway for cyber attacks."
        ],
        "followUps": [
            "Would you like to know how to enable automatic updates?",
            "Do you want tips on managing software updates effectively?",
            "Are you interested in understanding the importance of patch management?"
        ]
    }
}